using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace BFM.Common.DeviceAsset
{
    //计算模块
    public class Calculation
    {
        /****************************************************
         *
         *  设备虚拟点计算模块
         *
         *  1.逻辑运算（结果为1,0):({标签1}==1)&&({标签2}==1)&&({标签3}==0||{标签4}==0)&&({标签5}==1)
         *              
         *  2.数值运算:({标签1}+3+{标签2})*4
         *
         *  3.字符运算：{标签1}+"123"
         *
         *  12.条件数值运算:{标签1}=3:{标签2}+1;{标签1}=4:{标签2}+2;{标签1}=5:{标签2}+3
         *
         *  13.条件字符运算:{标签1}=3:{标签1}+"123";{标签1}=4:{标签1}+"123"
         *
         ***************************************************/
    }
}
